Revit 2015 API
View.SurfaceTransparency Property
 The amount of transparency applied to all surfaces. 0 = opaque, 100 = fully transparent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2015, use GetViewDisplayModel and SetViewDisplayModel instead.")]
public int SurfaceTransparency { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2015, use GetViewDisplayModel and SetViewDisplayModel instead.")> _
Public Property SurfaceTransparency As Integer
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2015, use GetViewDisplayModel and SetViewDisplayModel instead.")]
public:
property int SurfaceTransparency {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The value is invalid. The valid range is 0 through 100
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This view does not contain display-related properties.
See Also
View Class
Autodesk.Revit.DB Namespace